Repository: BadgerBo/webi
Catalog: webi/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: My name is Olesya Barsukova. I prefer when people just call me Lesya. I am 23 years old. I was born in the northern town named Murmansk, which is located beyond the Arctic Circle.
ru: Мое имя - Олеся Барсукова. Мне нравится, когда меня люди зовут меня просто Леся. Мне 23 года. Родилась я в северном городе под названием Мурманск, который расположен за границей Полярного круга.

source: In 2015 applied to State University of Industrial Technologies and Design and moved to Saint-Petersburg. In 2019 I obtained a Bachelor Honours Degree in Economics. Among all disciplines I enjoyed the most Advanced Math, Statistics and Business Engish.
ru: В 2015 году я поступила в СПбГУПТД и переехала в Санкт-Петербург. В 2019 году я получила диплом бакалавра с отличием по сециальности &laquo;Экономика&raquo;. Среди всех дисциплин мне больше всех нравились Высшая Математика, Статистика и Деловой Английский Язык.

source: Also, during the Computer Science cource, I faced basic concepts of Database. My high involvment in completing practical tasks revealed me that my true passion is programming. Since then, I became eager to devote my life to work in IT. So, nowdays I try my best to improve my coding skills to eventually get a job in this evergrowing and constantly evolving field.
ru: Также, во время курса по Информатике, я вперыве столкнулась с Базами Данных. Моя глубокая вовлеченность в выполнение практических заданий открыла мне, что моя настоящая страсть - это программирование. С тех пор я решила посвятить свою жизнь работе в сфере IT. Поэтому, в настоящее время, я изо всех сил стараюсь каждый день улучшать свои навыки, чтобы получить работу в этой постоянно растущей и прогрессирующей сфере.

source: Some facts about me:
ru: Некоторые факты обо мне:

source: I like my name because it reminds me of forest
ru: Я люблю свое имя, потому что оно напоминает мне о лесной природе

source: I am half Balarusian
ru: Я наполовину Белоруска

source: I dream to see Sequoia Tree someday
ru: Я мечтаю когда-нибудь вживую увидеть секвойю

source: I usually eat kiwi with a skin
ru: Обычно я ем киви со шкуркой

source: Photograph of jellyfish was taken at St. Petersburg's Oceanarium
ru: Фотография этих медуз была сделана в Питерском Океанариуме

source: Olesya Barsukova
ru: Олеся Барсукова

source: About Me
ru: Обо Мне

source: Skillset
ru: Навыки

source: Portfolio
ru: Портфолио

source: Contact Info
ru: Контактная информация

source: All rights reserved.
ru: Все права защищены

source: Name
ru: Имя

source: Message
ru: Сообщение

source: SEND
ru: ОТПРАВИТЬ

source: Greetings! You are at the main page of my personal website. Thank you for visiting and Welcome! :)
ru: Приветствую Вас на главной странице моего личного вебсайта. Благодарю за посещение и добро пожаловать! :)

source: Telegram Bot &laquo;Book Advisor&raquo;
ru: Телеграм Бот &laquo;Book Advisor&raquo;

source: In the near future I am going to finish my old project: Telegram Bot &laquo;Book Advisor&raquo;.
ru: В ближайшее время я собираюсь закончить свой старый проект: Телеграм-Бот &laquo;Book Advisor&raquo;.

source: Personal Website
ru: Личный Вебсайт

source: This website is my first attempt in web-development and my first project as well. The application was created by means of web framework Flask.
ru: Данный сайт является моей первой попыткой в веб-разработке, а также моим первым проектом. Приложение было создано с помощью веб-фреймворка Flask.

source: My first programming language was C#. At that time I knew nearly nothing about coding. So, it was a rough challenge, for sure. Nowdays I am still truelly amazed that I havent quit just right there.
ru: Моим первым языком программирования был C#. На тот момент я знала очень мало. Поэтому, его изучение давалось мне очень тяжело. Я до сих пор удивлена, что не бросила эту затею еще тогда.

source: After some time, I resumed my attempts with Python and fell in love from the first line. I respect the syntactic beauty and minimalism of this language.
ru: Через некоторое время, я возобновила попытки с Python. И это была любовь с первой строчки. Мне нравится синтаксическая красота и минимализм этого языка.

source: Recenetly I decided to dive into web-development and started to study HTML and CSS as well.
ru: С недавних пор я решила погрузиться в веб-разработку и начала изучать HTML и CSS.

source: Nowadays I take interest in SQL and I am planning to learn more about data and databases.
ru: В настоящее время, моим главным интересом является SQL. Я собираюсь узнать больше о базах данных.

source: If were to describe my skills, I would do it somehow like this:
ru: Если бы меня попросили наглядно описать мои навыки, то я изобразила бы их примерно так:
